Repository: wielandb/finetune-collect
Catalog: src/translation/Finetune-Collector_*.po
Languages: german

# MESSAGES_AUDIO_MESSAGE_TITLE
source: Audio Message
german: Audio Nachricht

# MESSAGE_AUDIO_AUDIO_EDIT_PLACEHOLDER
source: Audio base64 data goes here...
german: Hier kommen die base64-Daten hin...

source: Supported Audio Files
german: Unterstuetzte Audio-Dateien

# SETTINGS_RFT_SPLIT_CONVO_LABEL
source: Create RFT-Subconversations
german: RFT-Subunterhaltungen erzeugen

# SETTINGS_RFT_SPLIT_CONVERSATIONS_HINT
source: In RFT, only the last Function Call or JSON message is actually trained upon. If you want to teach your (agentic) model to correctly make every function call in a long conversation, every function call needs to exist as the last message once. This setting automatically splits your conversations in RFT to train on every function call. Produces more training examples that will cost more money. Turn off if you are very sure the model can do everything sufficient already except from the last step.
german: Im RFT wird nur auf dem letzten Funktionsaufruf oder auf der letzten JSON Schema Nachricht trainiert. Wenn du deinem (agentischen) Modell beibringen möchtest, wie man jede Funktion auf dem Weg richtig benutzt, muss es die Unterhaltung ein mal pro Funktionsaufruf geben, mit dem jeweiligen Funktionsaufruf als letzte Nachricht. Diese Einstellung erzeugt automatisch die dafür nötigen Unterhaltungen im Export. Erzeugt mehr Trainingsbeispiele die mehr kosten werden. Deaktiviere diese Option wenn du sicher bist dass das Modell bereits alles ausreichend kann bis auf den letzten Schritt.

# SETTINGS_RFT_SPLIT_YES_OPTION
source: Yes, create conversation for each function call
german: Ja, erzeuge eine Unterhaltung für jeden Funktionsaufruf

# SETTINGS_RFT_SPLIT_NO_OPTION
source: No, only create one training example per conversation
german: Nein, erzeuge nur ein Trainingsbeispiel pro Unterhaltung

# FROMCLIPBOARDJSON_LABEL_TEXT
source: Paste JSON from Clipboard
german: JSON aus Zwischenablage einfügen

# FROMCLIPBOARDJSON_HINT
source: Pastes Messages that were copied in the OpenAI message JSON format
german: Fügt Nachrichten aus der Zwischenablage ein, die im OpenAI messages JSON-Format vorliegen

source: Load from clipboard JSON
german: Aus Zwischenablagen-JSON laden

# SETTINGS_IMAGE_UPLOAD_LABEL
source: Auto-Upload images to image server
german: Bilder automatisch hochladen

# SETTINGS_IMAGE_UPLOAD_HINT
source: Automatically upload images to the image upload script specified in the URL. Useful if a lot of image files make the program respond slowly.
german: Lokale Bilder automatisch auf den Server in der URL hochladen. Nützlich wenn das Programm aufgrund vieler großer Bilddateien langsam reagiert.

# IMAGE_UPLOAD_SETTING_BUTTON_OPTION_NEVER
source: Never
german: Niemals

# IMAGE_UPLOAD_SETTING_BUTTON_OPTION_ALWAYS
source: Always
german: Immer

# SETTINGS_IMAGE_UPLOAD_URL_LABEL
source: URL to image upload script
german: URL zum Upload-Skript

# SETTINGS_IMAGE_UPLOAD_URL_HINT
source: The URL to a hosted instance of the upload-image.php file from the scripts directory
german: Die URL zu einer gehosteten Instanz des upload-image.php Skripts aus dem scripts/-Ordner

# SETTINGS_IMAGE_UPLOAD_KEY_LABEL
source: Secret key
german: Geheimer Schlüssel

# SETTINGS_IMAGE_UPLOAD_KEY_HINT
source: The secret key you've set in the upload-image.php file
german: Der geheime Schlüssel, der in der upload-image.php festgelegt wurde

# SETTINGS_IMAGE_UPLOAD_TEST_BUTTON
source: Test upload server
german: Upload-Server testen

# GRADERS_ADD_GRADER_BUTTON_TEXT
source: Add grader
german: Grader hinzufügen

source: Sample Item
german: Beispiel-Element

source: Sample Model Output
german: Beispiel-Modellausgabe

source: Grader type
german: Grader typ

# GRADER_NOT_VERIFIED_YET
source: Not verified
german: Nicht verifiziert

# GRADER_COPY_TO_CLIPBOARD
source: Copy to clipboard
german: In Zwischenablage kopieren

# GRADER_USE_THIS_GRADER
source: Use this Grader
german: Diesen Grader verwenden

# GRADER_DELETE_GRADER
source: Delete Grader
german: Grader löschen

# GRADER_NAME_HINT
source: The name of the grader. Used for your reference or as a variable in a multi-grader
german: Name des Graders. Wird als Referenz für dich und als Variable in multi-gradern verwendet.

source: Add Message
german: Nachricht hinzufuegen

# LABEL_CLICKING_HINT_PART_1
source: Right-click a label to define it as passing label. Labels with
german: Label rechtsklicken, um es als "bestehen"-Label zu definieren. "Bestehende" Labels sind mit

source: Add Grader
german: Grader hinzufuegen

source: Score Formula:
german: Bewertungsformel:

source: Range:
german: Bereich:

source: From
german: Von

source: to
german: bis

source: Sampling parameters:
german: Sampling-Parameter:

source: Temperature:
german: Temperatur:

source: Input
german: Eingabe

source: Reference
german: Referenz

source: Input:
german: Eingabe:

source: Reference:
german: Referenz:

source: Evaluation metric:
german: Evaluations-Metrik:

# TOOLTIP_COPY_TO_CLIPBOARD
source: Copy to clipboard
german: In Zwischenablage kopieren

# GRADER_SAMPLE_ITEM
source: Sample Item
german: Referenz-Item

# GRADER_SAMPLE_MODEL_OUTPUT
source: Sample Model Output
german: Beispiel Modell-Output

# GRADER_MESSAGES_COLON
source: Messages:
german: Nachrichten:

# GRADER_NEW_LABEL_COLON
source: New label:
german: Neues Label:

# GRADER_ADD_GRADER
source: Add Grader
german: Grader hinzufügen

# GRADER_MULTIGRADER_SCORE_FORMULA_COLON
source: Score formula:
german: Bewertungs-Formel:

# GENERIC_ADD_COLON
source: Add:
german: Hinzufügen:

# GRADER_ADD_MESSAGE
source: Add message
german: Nachricht hinzufügen

# GRADER_OPERATION
source: Operation
german: Operator

# GRADER_REFERENCE
source: Reference
german: Referenz

# GRADER_REFERENCE_COLON
source: Reference:
german: Referenz:

# GRADER_EVALUATION_METRIC_COLON
source: Evaluation metric:
german: Evaluationsmetrik:

# LABEL_CLICKING_HINT_PART_2
source: are defined as passing labels.
german: gekennzeichnet.

# GRADER_RANGE_COLON:
source: Range:
german: Bereich:

# GRADER_FROM
source: from
german: Von

# GRADER_TO
source: to
german: bis

# GRADER_SAMPLING_PARAMETERS_COLON
source: Sampling parameters:
german: Sampling-Parameter:

# GRADER_TEMERATURE_COLON
source: Temperature:
german: Temperatur:

# GRADER_MODEL_COLON
source: Model:
german: Modell:

source: Grader not complete!
german: Grader unvollständig!

# GRADER_VERIFYING
source: Verifying grader...
german: Verifiziere Grader...

source: Grader verification error!
german: Verifizierungsfehler!

# GRADER_VERIFIED
source: Verified!
german: Verifiziert!

source: Schemas
german: Schemata

# SETTINGS_SCHEMA_VALIDATOR_URL_HINT
source: The URL path to the file schema_validator.php from the scripts/ directory of the Repo, hosted somewhere. The developer provides an instance, but keep in mind that all schemas are transmitted to this URL.
german: Die URL zu einer irgendwo gehosteten Instanz der Datei schema_validator.php aus dem scripts/-Ordner im Repository. Der Entwickler stellt eine Instanz zur Verfügung, aber bedenke dass alle Schemata an diese URL übertragen werden.

# DISABLED_EXPLANATION_NEEDS_AT_LEAST_ONE_SCHEMA
source: At least one schema must be set in the schemas tab
german: Mindestens ein Schema muss im Schema-Tab definiert werden

source: Edit JSON
german: JSON bearbeiten

# SCHEMAS_SCHEMA_VALIDATED
source: Schema valid!
german: Schema valide!

source: Add Schema
german: Schema hinzufügen

source: Only JSON, no schema
german: Nur JSON, kein Schema

# MESSAGES_JSON_SCHEMA_FORM_TAB
source: Form
german: Formular

# MESSAGES_JSON_SCHEMA_RAW_TAB
source: Raw JSON
german: Rohes JSON

# MESSAGES_JSON_SCHEMA_FORM_HINT
source: Fill values using the schema-generated form.
german: Werte direkt im aus dem Schema erzeugten Formular eingeben.

# MESSAGES_JSON_SCHEMA_FORM_NO_SCHEMA
source: Select a schema to enable the generated form editor.
german: Wähle ein Schema aus, um den Formular-Editor zu aktivieren.

# MESSAGES_JSON_SCHEMA_FORM_PARTIAL_FALLBACK
source: Some schema parts use embedded raw JSON editors.
german: Einige Schema-Teile verwenden eingebettete Raw-JSON-Editoren.

# MESSAGES_JSON_SCHEMA_EXTERNAL_EDITOR_DISABLED
source: External schema editor disabled because no URL is configured.
german: Externer Schema-Editor deaktiviert, da keine URL konfiguriert ist.

# MESSAGES_JSON_SCHEMA_EXTERNAL_EDITOR_ENABLED
source: Open external schema editor (optional fallback).
german: Externen Schema-Editor Ã¶ffnen (optionaler Fallback).

# MESSAGES_JSON_SCHEMA_FORM_USE_NULL
source: Use null
german: Null verwenden

# MESSAGES_JSON_SCHEMA_FORM_INCLUDE
source: Include
german: Einbeziehen

# MESSAGES_JSON_SCHEMA_FORM_ADD_ITEM
source: Add item
german: Eintrag hinzufügen

# MESSAGES_JSON_SCHEMA_FORM_DELETE_ITEM
source: Delete
german: Löschen

# MESSAGES_JSON_SCHEMA_FORM_ITEM
source: Item
german: Element

# MESSAGES_JSON_SCHEMA_FORM_NO_PROPERTIES
source: No properties in this object schema.
german: Dieses Objekt-Schema hat keine Properties.

# MESSAGES_JSON_SCHEMA_ERROR_UNKNOWN
source: Validation error.
german: Validierungsfehler.

# MESSAGES_JSON_SCHEMA_ERROR_SCHEMA_EDITOR_MISSING
source: Schema editor is not available.
german: Schema-Editor ist nicht verfügbar.

# MESSAGES_JSON_SCHEMA_ERROR_INVALID_JSON
source: Invalid JSON.
german: Ungültiges JSON.

# MESSAGES_JSON_SCHEMA_ERROR_NO_SCHEMA
source: No schema selected.
german: Kein Schema ausgewählt.

# MESSAGES_JSON_SCHEMA_ERROR_ONE_OF_EXACTLY_ONE
source: Exactly one oneOf branch must match.
german: Genau ein oneOf-Zweig muss passen.

# MESSAGES_JSON_SCHEMA_ERROR_ANY_OF_NONE
source: No anyOf branch matched.
german: Kein anyOf-Zweig passt.

# MESSAGES_JSON_SCHEMA_ERROR_TYPE_MISMATCH
source: Type mismatch.
german: Typ passt nicht.

# MESSAGES_JSON_SCHEMA_ERROR_EXPECTED_OBJECT
source: Expected object.
german: Objekt erwartet.

# MESSAGES_JSON_SCHEMA_ERROR_EXPECTED_ARRAY
source: Expected array.
german: Array erwartet.

# MESSAGES_JSON_SCHEMA_ERROR_EXPECTED_STRING
source: Expected string.
german: String erwartet.

# MESSAGES_JSON_SCHEMA_ERROR_EXPECTED_NUMBER
source: Expected number.
german: Zahl erwartet.

# MESSAGES_JSON_SCHEMA_ERROR_EXPECTED_INTEGER
source: Expected integer.
german: Ganzzahl erwartet.

# MESSAGES_JSON_SCHEMA_ERROR_EXPECTED_BOOLEAN
source: Expected boolean.
german: Boolescher Wert erwartet.

# MESSAGES_JSON_SCHEMA_ERROR_ADDITIONAL_PROPERTY
source: Additional property is not allowed by schema.
german: Zusätzliches Feld ist laut Schema nicht erlaubt.

# MESSAGES_JSON_SCHEMA_ERROR_ADDITIONAL_PROPERTY_NOT_ALLOWED
source: Additional property is not allowed.
german: Zusätzliches Feld ist nicht erlaubt.

# MESSAGES_JSON_SCHEMA_ERROR_MISSING_PROPERTY
source: Missing required property.
german: Pflichtfeld fehlt.

# MESSAGES_JSON_SCHEMA_ERROR_MISSING_REQUIRED_PROPERTY
source: Missing required property.
german: Pflichtfeld fehlt.

# MESSAGES_JSON_SCHEMA_ERROR_TOO_FEW_ITEMS
source: Too few array items.
german: Zu wenige Array-Einträge.

# MESSAGES_JSON_SCHEMA_ERROR_TOO_MANY_ITEMS
source: Too many array items.
german: Zu viele Array-Einträge.

# MESSAGES_JSON_SCHEMA_ERROR_TOO_FEW_ARRAY_ITEMS
source: Too few array items.
german: Zu wenige Array-Einträge.

# MESSAGES_JSON_SCHEMA_ERROR_TOO_MANY_ARRAY_ITEMS
source: Too many array items.
german: Zu viele Array-Einträge.

# MESSAGES_JSON_SCHEMA_ERROR_DUPLICATE_ITEM
source: Duplicate array item.
german: Doppelter Array-Eintrag.

# MESSAGES_JSON_SCHEMA_ERROR_VALUE_NOT_IN_ENUM
source: Value is not in enum.
german: Wert ist nicht im Enum enthalten.

# MESSAGES_JSON_SCHEMA_ERROR_CONST_MISMATCH
source: Value does not match const.
german: Wert passt nicht zur const-Vorgabe.

# MESSAGES_JSON_SCHEMA_ERROR_NUMBER_BELOW_MINIMUM
source: Number is below minimum.
german: Zahl liegt unter dem Minimum.

# MESSAGES_JSON_SCHEMA_ERROR_NUMBER_ABOVE_MAXIMUM
source: Number is above maximum.
german: Zahl liegt über dem Maximum.

# MESSAGES_JSON_SCHEMA_ERROR_NUMBER_BELOW_OR_EQUAL_EXCLUSIVE_MINIMUM
source: Number must be greater than exclusive minimum.
german: Zahl muss größer als exclusiveMinimum sein.

# MESSAGES_JSON_SCHEMA_ERROR_NUMBER_ABOVE_OR_EQUAL_EXCLUSIVE_MAXIMUM
source: Number must be less than exclusive maximum.
german: Zahl muss kleiner als exclusiveMaximum sein.

# MESSAGES_JSON_SCHEMA_ERROR_NUMBER_NOT_MULTIPLE_OF
source: Number is not a valid multiple.
german: Zahl ist kein gültiges Vielfaches.

# MESSAGES_JSON_SCHEMA_ERROR_STRING_MIN_LENGTH
source: String is shorter than minLength.
german: String ist kürzer als minLength.

# MESSAGES_JSON_SCHEMA_ERROR_STRING_MAX_LENGTH
source: String is longer than maxLength.
german: String ist länger als maxLength.

# MESSAGES_JSON_SCHEMA_ERROR_INVALID_PATTERN
source: Schema pattern is invalid.
german: Pattern im Schema ist ungültig.

# MESSAGES_JSON_SCHEMA_ERROR_STRING_PATTERN_MISMATCH
source: String does not match pattern.
german: String passt nicht zum Pattern.

# MESSAGES_JSON_SCHEMA_ERROR_NO_UNION_BRANCH
source: No matching union branch.
german: Kein passender Union-Zweig.

# MESSAGES_JSON_SCHEMA_ERROR_NULL_NOT_ALLOWED
source: Value must not be null.
german: Wert darf nicht null sein.

# MESSAGES_JSON_SCHEMA_ERROR_STRING_FORMAT_MISMATCH
source: String does not match format: {format}.
german: String passt nicht zum Format: {format}.

# MESSAGES_JSON_SCHEMA_ERROR_PATH
source: Path: {path}
german: Pfad: {path}
