Repository: wielandb/finetune-collect
Catalog: src/translation/Finetune-Collector_*.po
Languages: german

# FUNCTIONS_PARAMETERS_PARAMETER_TYPE_LABEL
source: Typ
german: Parametertyp

# FUNCTIONS_PARAMETERS_PARAMETER_TYPE_CHOICE_NUMBER
source: Number
german: Nummer

# FUNCTIONS_PARAMETERS_PARAMETER_DESCRIPTION_LABEL
source: Description
german: Beschreibung

source: Has limits
german: Begrenzt

# FUNCTIONS_PARAMETERS_PARAMETER_REQUIRED_LABEL
source: Required?
german: benötigt?

# FUNCTIONS_FUNCTION_TITLE
source: Function
german: Funktion

# FUNCTIONS_FUNCTION_DESCRIPTION
source: Description:
german: Beschreibung:

# FUNCTIONS_FUNCTION_PARAMETERS_TITLE
source: Function Parameters
german: Parameter

# FUNCTIONS_DELETE_FUNCTION
source: Delete Function
german: Funktion löschen

# SETTINGS_USE_GLOBAL_SYSTEM_MESSAGE
source: Use global system message
german: Nutze eine Systemnachricht für alle Chats

# SETTINGS_GLOBAL_SYSTEM_MESSAGE_TITLE
source: Global system message
german: Globale System-Nachricht

# SETTINGS_IMAGE_MINIMAL_HEIGHT
source: Minimal image height
german: Minimale Bildgröße

# SETTINGS_INCLUDE_WHAT_FUNCTIONS_ON_EXPORT
source: Include which functions on export?
german: Welche Funktionen in Export einschließen?

# SETTINGS_API_KEY
source: API key:
german: API-Schlüssel

# SETTINGS_MODEL_TO_USE_FOR_COMPLETIONS
source: Model to use for completions
german: Modell für Vervollständigungen

# GENERIC_REFRESH
source: Refresh
german: Neu laden

# FINETUNE_CONVERSATION_NEW
source: New conversation
german: Neue Unterhaltung

# FINETUNE_LOAD
source: Load fine-tune file
german: Lade Fine-Tune

source: Open a File
german: Datei oeffnen

source: Open
german: Oeffnen

# FINETUNE_SAVE
source: Save fine-tune file
german: Speichere Fine-Tune

# FUNCTIONS_ADD_NEW_FUNCTION
source: Add new function
german: Neue Funktion

source: Parameter Key
german: Parameter-Schluessel

source: Parameter Value
german: Parameterwert

# MESSAGE_USE_PARAMETER_CHECKBOX_TITLE
source: Use parameter
german: Benutze Parameter

source: user
german: Benutzer

source: assistant
german: Assistent

source: Image
german: Bild

source: Function Call
german: Funktionsaufruf

# GENERIC_DELETE
source: Delete
german: Löschen

# MESSAGES_TEXT_MESSAGE_TITLE
source: Text message
german: Textnachricht

# MESSAGES_IMAGE_MESSAGE_TITLE
source: Image message
german: Bildnachricht

# MESSAGES_LOAD_IMAGE
source: Load image
german: Bild laden

# MESSAGE_USE_FUNCTION_TITLE
source: Use function
german: Benutze Funktion

# MESSAGE_USE_WHICH_MESSAGE
source: Which?
german: Welche?

# MESSAGE_PARAMETERS_TITLE
source: Function Parameters
german: Parameter

# MESSAGE_FUNCTION_RESULT_TITLE
source: Result
german: Ergebnis

source: Add result
german: Ergebnis hinzufügen

# MESSAGES_ADD_MESSAGE
source: Add message
german: Nachricht hinzufügen

# MESSAGES_ADD_CHATGPT_COMPLETION
source: Add ChatGPT completion
german: Nachricht vervollständigen lassen

# MESSAGE_USE_FUNCTION
source: Use function
german: Benutze Funktion

# MESSAGE_FUNCTION_ADD_RESULT
source: Add result
german: Ergebnis hinzufügen

# ANALYSIS_RUN_ANALYSIS
source: Run analysis
german: Analyse durchführen

# ANALYSIS_STATISTICS_TITLE
source: Statistics
german: Statistiken

# ANALYSIS_WARNINGS_TITLE
source: Warnings
german: Warnungen

# ANALYSIS_ERROS_TITLE
source: Errors
german: Fehler

# SETTINGS_INCLUDE_FUNCTIONS_OPTION_ALLWAYS_ALL
source: Always include all functions
german: Immer alle Funktionen einschließen

# SETTINGS_INCLUDE_FUNCTIONS_OPTION_ONLY_IN_USED_CONVERSATIONS
source: Only include functions used in that conversation
german: Nur in der jeweiligen Unterhaltung genutzte einschließen

# SETTINGS_INCLUDE_FUNCTIONS_OPTION_ALL_ONCE_USED
source: Always include all function that were used at least once anywhere
german: Alle immer einschließen, die mindestens ein mal genutzt wurden

# SETTINGS_INCLUDE_WHAT_FUNCTIONS_ON_EXPORT_TOOLTIP
source: For every conversation, every function that the model can (or could) use needs to be provided. To save tokens in training, it can be useful to only provide the functions as available that are actually used in this conversation. But this could also lead to false training, especially when the goal is to teach the model when not to use a function.
german: Für jede Unterhaltung muss dem Modell die Menge an verfügbaren Funktionen mitgeteilt werden. Um Tokens im Training zu sparen bietet es sich an, nur die Funktionen als Verfügbar mitzugeben, die auch in der jeweiligen Konversation verwendet wurden. Das kann allerdings zu falschen Trainingsergebnissen führen, insbesondere wenn das Ziel ist dem Modell beizubringen, wann keine Funktion genutzt werden sollte.

# SETTINGS_API_KEY_TOOLTIP
source: Your OpenAI API key. Used to poll for completions and to fetch the list of available models.
german: Dein OpenAI API Schlüssel. Wird benutzt um vervollständigungen zu erhalten und um die Liste der verfügbaren Modelle abzurufen.

# SETTINGS_MODEL_TO_USE_FOR_COMPLETIONS
source: Model to use for completions
german: Modell für Vervollständigungen

# SETTINGS_MODEL_TO_USE_FOR_COMPLETIONS_TOOLTIP
source: The model that should be used for completions. Note that although all models you have access to are listed here, only a small subset would be able to be used for this feature.
german: Das Modell das für Vervollständigungen genutzt werden soll. Beachte dass obwohl alle Modelle auf die du Zugriff hast hier aufgelistet sind, nur die wenigsten für diese Funktion genutzt werden können.

# FINETUNE_EXPORT
source: Export Fine-Tune
german: Exportiere Fine-Tune

# FINETUNE_EXPORTING
source: Exporting
german: Exportiere

# FINETUNE_EXPORTING_IMAGE_DOWNLOAD
source: Downloading image...
german: Bild wird heruntergeladen...

# GENERIC_SAVE
source: Save
german: Speichern

# GENERIC_CANCEL
source: Cancel
german: Abbrechen

# SETTINGS_GLOBAL_SYSTEM_MESSAGE_TOOLTIP
source: If activated, this message will be prepended as a system message to all conversations in export and on auto completion. Useful if you want to use one system message for your whole fine tune.
german: Wenn aktiviert, wird diese Nachricht als Systemnachricht allen Konversationen beim Export und bei der automatischen Vervollständigung vorgehangen. Nützlich, wenn eine Systemnachricht für das gesamte Fine-Tuning verwendet werden sollen.

# STANDARD_GLOBAL_SYSTEM_MESSAGE
source: You are a helpful assistant!
german: Du bist ein hilfreicher Assistent!

# MESSAGES_IMAGE_DETAIL
source: Image detail
german: Bild-Detailgrad

# MESSAGES_IMAGE_DETAIL_TOOLTIP
source: Determines how high the quality of the image that is shown to the model will be. Low detail uses less tokens, but the model may not be able to see important details.
german: Bestimmt wie hoch die Qualität des Bildes ist, die das Modell zu sehen bekommt. Niedrige Qualität verbraucht weniger Tokens, aber das Modell kann dann eventuell wichtige Details nicht sehen.

# MESSAGES_IMAGE_DETAIL_OPTION_HIGH
source: High
german: Hoch

# MESSAGES_IMAGE_DETAIL_OPTION_LOW
source: Low
german: Niedrig

# MESSAGES_IMAGE_DETAIL_OPTION_AUTO
source: Auto
german: Automatisch

# SETTINGS_INCLUDE_FUNCTIONS_OPTION_ALL_IF_AT_LEAST_ONE_USED_IN_CONVO
source: Include all if functions are used in the conversation
german: Alle einschließen, wenn in einer Unterhaltung Funktionen genutzt werden

# MESSAGE_FUNCTION_PRETEXT_LABEL
source: Message before executing function (optional)
german: Nachricht vor Funktionsausführung (optional)

# SETTINGS_FINETUNE_TYPE_LABEL
source: Finetuning-Method
german: Finetuning-Methode

# SETTINGS_FINETUNE_TYPE_TOOLTIP
source: The kind of fine-tuning this fine tune should be. Supervised: The most common fine tuning type. Supports images and functions and more. Shows the model a correct conversation. Direct preference optimization: Very limited, only 2 messages per converrsation. Shows the model a preferred and a non-preferred output for an input. Useful for fine-tuning a fine-tune. Reinforcement fine-tuning: Not publicy available yet. Implements a grader that can dynamically reinforce a correct behaviour.
german: Die Art des fine-tunings für das diese Datei sein soll. Supervised: Die häufigste Art des fine-tunings. Unterstützt Bilder, Funktionen und noch mehr. Zeigt dem Modell eine korrekte Unterhaltung. Direct preference optimization: Sehr beschränkt, nur 2 Nachrichten pro Unterhaltung. Zeigt dem Modell eine bevorzugte und eine nicht-bevorzugte Antwort für einen Input. Nützlich, um einen fine-tune weiter zu verbessern. Reinforcement fine-tuning: Noch nicht öffentlich verfügbar. Implementiert eine Bewertungsfunktion die dynamisch korrektes Verhalten verstärkt.

# MESSAGES_DPO_UNPREFERRED_MSG_LABEL
source: Non-preferred output
german: nicht-bevorzugte Antwort

# MESSAGES_DPO_PREFERRED_MSG_LABEL
source: Preferred output
german: bevorzugte Antwort

# FUNCTIONS_ADD_FUNCTION
source: Add function
german: Funktion hinzufügen

# SETTINGS_EXPORT_IMAGES_HOW_LABEL
source: How to export images
german: Bilder exportieren als...

# SETTINGS_EXPORT_IMAGES_HOW_TOOLTIP
source: Defines how images will be exported into the fine-tuning file. Like specified: Always export the image like it was given (either as base64 or via URL) Always as base64: Convert URLs to base64 images when exporting Always as URLs: Upload base64 Images to a web server and only export the URLs
german: Definiert, wie Bilder in die fine-tuning Datei exportiert werden. Wie gegeben: Die Bilder immer so exportieren, wie sie auch gegeben worden (entweder als base64 oder als URL) Immer als base64: Konvertiere URLs zu base64 Bildern beim Export Immer als URLs: Lade base64-Bilder auf einen Webserver hoch und exportiere nur die URLs

# SETTINGS_EXPORT_IMAGES_HOW_OPTION_LIKE_SPECIFIED
source: Like specified
german: Wie gegeben

# SETTINGS_EXPORT_IMAGES_HOW_OPTION_BASE64
source: Always as base64
german: Immer als base64

# SETTINGS_EXPORT_IMAGES_HOW_OPTION_URL
source: Always as URLs
german: Immer als URLs

# MESSAGES_LOAD_IMAGE_FROM_FILE
source: Load image from file
german: Bild von Datei laden

# MESSAGES_LOAD_IMAGE_FROM_URL
source: Load image from URL
german: Bild von URL laden

# FUNCTIONS_ADD_FUNCTION_PARAMETER
source: Add function parameter
german: Neuer Funktionsparameter

# MESSAGE_IMAGE_IMAGE_EDIT_PLACEHOLDER
source: URL or Base64
german: URL oder Base64

# SETTINGS_USE_USER_NAMES
source: Use user names
german: Nutzernamen benutzen

# MESSAGES_USER_NAME
source: User name
german: Nutzername

# SETTINGS_SCHEMA_EDITOR_URL
source: URL of the schema editor:
german: URL des Schema-Editors:

# SETTINGS_SCHEMA_EDITOR_URL_HINT
source: The URL where an instance of the Schema-Editor-PHP-File from the repository is hosted. The developer also provides an instance. Keep in mind that your Data is transferred to the developer's server if you use the standard endpoint.
german: Die URL zu einer Instanz der Schema-Editor-PHP-Datei, die im GitHub zu finden ist. Es gibt eine bereitgestellte Instanz vom Entwickler. Bedenke, dass, wenn du diese benutzt, deine Daten an einen Server vom Entwickler übertragen werden.

# GENERIC_CHECK
source: Check
german: Prüfen

# SETTINGS_SCHEMA_LOAD_FILE
source: Load JSON schema from file
german: JSON-Schema aus Datei laden

# MESSAGES_JSON_SCHEMA_MESSAGE_TITLE
source: Message as JSON schema
german: Nachricht in JSON nach Schema

# MESSAGES_JSON_SCHEMA_EDIT_BUTTON
source: Open browser to edit message/data
german: Browser öffnen, um Nachricht/Daten zu bearbeiten

# MESSAGES_JSON_SCHEMA_POLLING
source: Waiting for end of editing in browser...
german: Warte auf Abschluss der Bearbeitung im Browser

# MESSAGES_JSON_SCHEMA_REOPEN_BROWSER
source: Reopen browser
german: Browser erneut öffnen

# DISABLED_EXPLANATION_NOT_IMPLEMENTED_YET
source: Not implemented yet
german: Noch nicht implementiert

# DISABLED_EXPLANATION_FUNCTIONS_MUST_USE_ALL_PARAMETERS
source: Functions must use all their parameters
german: Funktionen müssen all ihre Parameter benutzen

# DISABLED_EXPLANATION_SYSTEM_USER_CANT_DO_THAT
source: The system user can't do that
german: Der System-Nutzer kann das nicht tun

# DISABLED_EXPLANATION_ONLY_ASSISTANT_CAN_USE_FUNCTIONS
source: Only the assistant can use functions
german: Nur der Assistent kann Funktionen benutzen

# DISABLED_EXPLANATION_ONLY_ASSISTANT_CAN_RESPOND_IN_SCHEMA
source: Only the assistant can respond in JSON schema
german: Nur der Assistent kann in JSON antworten

# DISABLED_EXPLANATION_ASSISTANT_CANT_SEND_IMAGES
source: The assistant can't send images
german: Der Assistent kann keine Bilder senden

# DISABLED_EXPLANATION_NEEDS_AT_LEAST_ONE_FUNCTION
source: At least one function must be defined to use that
german: Mindestens eine Funktion muss definiert sein um das benutzen zu können

# DISABLED_EXPLANATION_NEEDS_VALID_JSON_IN_SETTINGS
source: A valid JSON schema in the settings is needed to use that
german: Ein valides JSON muss in den Einstellungen hinterlegt werden um das benutzen zu können

# DISABLED_EXPLANATION_DPO_ONLY_SUPPORTS_TEXT
source: Direct Prefernce Optimization (DPO) only supports text
german: Direct Preference Optimization (DPO) unterstüzt nur Text

# DISABLED_EXPLANATION_NEEDS_OPENAI_API_KEY
source: OpenAI API key needed to be set in settings
german: Ein OpenAI API Key muss in den Einstellungen hinterlegt werden

# DISABLED_EXPLANATION_NEEDS_AT_LEAST_ONE_MESSAGE
source: At least one message is needed
german: Mindestens eine Nachricht wird benötigt

# DISABLED_EXPLANATION_DISABLED_AS_LONG_AS_FUNCTION_WITHOUT_NAME_EXISTS
source: Disabled as long as a function without a name exists
german: Deaktiviert solange eine Funktion ohne Name existiert

# DISABLED_EXPLANATION_DISABLED_AS_LONG_AS_FUNCTION_WITHOUT_DESCRIPTION_EXISTS
source: Disabled as long as a function without a description exists
german: Deaktiviert solange eine Funktion ohne Beschreibung existiert

# DISABLED_EXPLANATION_DISABLED_AS_LONG_AS_FUNCTION_PARAMETER_WITHOUT_NAME_EXISTS
source: Disabled as long as a function with a parameter without a name exists
german: Deaktiviert solange eine Funktion mit einem Parameter ohne Name existiert

source: Disabled as long as a function with a parameter without a description exists
german: Deaktiviert solange eine Funktion mit einem Parameter ohne Beschreibung existiert

# MESSAGE_LIST_ASK_OPENAI_API_FOR_ANSWER
source: Ask the OpenAI API for a completion
german: Die OpenAI API nach einer Vervollständigung fragen

# DISABLED_EXPLANATION_DPO_ONLY_ALLOWS_ONE_USER_AND_ONE_ASSISTANT_MESSAGE
source: Direct Preference Optimization (DPO) only allows for one user and one assistant message
german: Direct Preference Optimization (DPO) erlaubt nur eine Nutzer und eine Assistenten-Nachricht

# MESSAGES_JSON_SCHEMA_OPEN_EDITOR_IN_NEW_TAB
source: Open schema editor in new tab
german: Schema-Editor in neuem Tab öffnen

# DISABLED_EXPLANATION_NOT_AVAILABLE_IN_WEB
source: Not available in Web export
german: Nicht im Web-Export verfügbar

# SETTINGS_BATCH_CREATION_LABEL_TEXT
source: Batch creation of new conversations
german: Serienerzeugung neuer Unterhaltungen

# SETTINGS_BATCH_CREATION_TOOLTIP
source: Enables you to quickly import a load of files. For every file, a new conversation will be created with that file as the first message. You can load text files or images.
german: Damit kann eine große Menge Dateien importiert werden. Für jede Datei wird eine neue Unterhaltung erstellt, bei der die Datei die erste Nachricht ist. Es können Text- oder Bilddateien geladen werden.

# ROLE_USER
source: User
german: Nutzer

# ROLE_ASSISTANT
source: Assistant
german: Assistent

# SETTINGS_BATCH_CREATION_MODE_NEW
source: Create new
german: Neue erzeugen

# SETTINGS_BATCH_CREATION_MODE_APPEND
source: Append to existing
german: An bestehende anhängen

# SETTINGS_BATCH_CREATION_LOAD_FILES
source: Chose files to create conversations from
german: Dateien wählen, um Unterhaltungen zu erzeugen

source: Open File(s)
german: Datei(en) öffnen

# FUNCTIONS_ENABLE_EXECUTION
source: Enable local function execution
german: Lokale Funktionsausführung aktivieren

# FUNCTIONS_EXECUTABLE_PATH
source: Executable path
german: Anwendungspfad

# FUNCTIONS_EXECUTABLE_PARAMETERS
source: Executable Parameters
german: Anwendungsparameter

source: C:\Path\to\script.py<|>argument1<|>%parametername%<|>parameter2=%parameter2name%
german: C:\Pfad\zum\skript.py<|>argument1<|>%parametername%<|>parameter2=%parameter2name%

# FUNCTIONS_EXECUTABLE_PARAMETERS_EXPLANATION
source: Place all arguments after the executable here, separated by "<|>" (without quotation marks). E.g. for python, the first argument should be the path to the script. Parameter names enclosed in "%" will be replaced by their value on execution time, e.g. %parametername%.
german: Platziere alle Argumente für den Aufruf hier, getrennt mit "<|>" (ohne Anführungszeichen). z.B. für python sollte das erste Argument der Pfad zum Skript sein. Parameternamen, die in "%" eingeschlossen sind, werden zum Ausführungszeitpunkt durch den festgelgten Wert ausgetauscht, z.B. %parametername".

source: Test
german: Testen

# UNEXPECTED_PARAMETER_ERROR_PLEASE_REPORT_THIS
source: An unexpected parameter error occured! Please report this!
german: Ein unerwarteter Fehler mit dem Parameter ist passiert! Bitte melde das!

# DISABLED_EXPLANATION_NO_EXECUTABLE_DEFINED
source: No executable was defined. An executable needs to be defined in the function definition for this to work.
german: Keine Anwendung wurde definiert. In den Funktionsdefinitionen muss eine Anwendung definiert werden, damit das Funktioniert.

# DISABLED_EXPLANATION_ALL_PARAMETER_VALUES_MUST_BE_SET
source: All parameter values must be set for this to work.
german: Alle Parameterwerte müssen gesetzt sein, damit das funktioniert.

# MESSAGE_USE_WHICH_FUNCTION_LABEL
source: Which?
german: Welche?

# MESSAGE_EXECUTE_FUNCTION
source: Execute function
german: Funktion ausführen

# SETTINGS_TOKEN_COUNTER_PATH_LABEL_TEXT
source: Path to token counter script
german: Pfad zum Tokenzähler-Skript

# SETTINGS_TOKEN_COUNTER_PATH_HINT
source: The path to the python-file called "get_token_count.py" from the scripts/-directory from the repository somewhere on your system. Needed to calculate token costs.
german: Der Pfad zu der Datei namens "get_token_count.py" aus dem scripts/-Ordner dieses Repositorys. Wird benötigt um Token-Kosten zu berechnen.

# GENERIC_CHOOSE
source: Choose
german: Wählen

# GENERIC_CHOOSE_FILE
source: Choose file
german: Datei wählen

# DISABLED_EXPLANATION_NEEDS_TOKEN_COUNTER_PATH
source: A path to the token counter script must be set in the settings to use this.
german: Der Pfad zum Tokenzählskript muss in den Einstellungen festgelegt werden um das nutzen zu können.

# MESSAGE_META_HIDE_TOKEN_CALCS
source: Hide token calculations
german: Tokenberechnungen verstecken

# MESSAGE_META_SHOW_TOKEN_CALCS
source: Show token calculations
german: Tokenberechnungen zeigen

# MESSAGE_META_CONVERSATION_NAME_LABEL
source: Conversation name:
german: Unterhaltungsname:

# MESSAGE_META_CONVERSATION_NAME_HINT
source: You can give this conversation a name to find it faster in the panel on the left
german: Du kannst dieser Unterhaltung einen Namen geben um sie in der Leiste links später schneller wiederzufinden

# META_MESSAGE_NOTES_PLACEHOLDER
source: Notes
german: Notizen

# MESSAGE_META_READY_CHECKBOX_LABEL
source: Ready
german: Fertig

# MESSAGE_META_CONVERSATION_READY_HINT
source: Mark this conversation as "ready", so that you can quickly see on the left if you wanted to revisit a conversation later. It is also possible to only export conversations marked as "ready"
german: Diese Unterhaltung als "fertig" markieren, damit du schnell auf der linken Seite sehen kannst ob du eine Unterhaltung später noch einmal überprüfen willst. Es ist auch möglich, nur "fertige" Unterhaltungen zu exportieren

# META_MESSAGE_TOKEN_COST_ESTIMATION
source: Token cost estimation
german: Tokenkosten Schätzung

# META_MESSAGE_THIS_CONVERSATION
source: This conversation
german: Diese Unterhaltung

# META_MESSAGE_WHOLE_FINETUNE
source: Whole fine-tune
german: gesamter Fine-Tune

# META_MESSAGE_TOTAL_TOKENS
source: Total tokens
german: Gesamttokens

# META_MESSAGE_TRAINING_COST_4o
source: Training cost (4o)
german: Trainingskosten (4o)

# META_MESSAGE_TRAINING_COST_4omini
source: Training cost (4o-mini)
german: Trainingskosten (4o-mini)

# META_MESSAGE_INFERENCE_COST_4o
source: Inference cost (4o)
german: Inferenzkosten (4o)

# META_MESSAGE_INFERENCE_COST_4omini
source: Inference cost (4o-mini)
german: Inferenzkosten (4o-mini)

# META_MESSAGE_BATCH_INFERENCE_COST_4o
source: Batch inference cost (4o)
german: Batch-Inferenzkosten (4o)

# META_MESSAGE_BATCH_INFERENCE_COAT_4omini
source: Batch inference cost (4o-mini)
german: Batch-Inferenzkosten (4o-mini)

# META_MESSAGE_NUMBER_OF_IMAGES
source: Number of images
german: Anzahl Bilder

# SETTINGS_EXPORT_WHICH_CONVERSATIONS_LABEL
source: Export which conversations?
german: Welche Unterhaltungen exportieren?

# SETTINGS_EXPORT_WHICH_CONVOS_HINT
source: What conversations to include in the export. "Only unproblematic" means those where the program found an error (Marked by an X by the conversation icon) will not be exported. "Only ready" means only those where you set the checkbox that they are ready will be exported. "All" is not recommended and will probably lead to errors when uploading.
german: Welche Unterhaltungen im Export eingeschlossen werden sollen. "Nur unproblematische" bedeutet, Unterhaltungen die vom Programm als fehlerhaft eingeschätzt werden, (durch X beim Icon verdeutlicht) werden nicht exportiert. "Nur fertige" bedeutet nur die, bei denen der Haken gesetzt wurde, werden exportiert. "Alle" wird nicht empfohlen und kann beim Upload zu Fehlern führen.

# SETTINGS_EXPORT_WHAT_CONVOS_ONLY_UNPROBLEMATIC_OPTION
source: Only unproblematic
german: Nur unproblematische

# SETTINGS_EXPORT_WHAT_CONVOS_ONLY_READY_OPTION
source: Only ready
german: Nur fertige

# SETTINGS_EXPORT_WHAT_CONVO_ALL_OPTION
source: All (not recommended)
german: Alle (nicht empfohlen)

# SETTINGS_TOKEN_COUNT_WHEN_OPTION_SAVING
source: When saving
german: Beim Speichern

# SETTINGS_TOKEN_COUNT_WHEN_OPTION_NEVER
source: Never
german: Nie

# SETTINGS_TOKEN_COUNT_WHEN_LABEL
source: When to count tokens
german: Wann Tokens zählen?

# SETTINGS_WHEN_TOKEN_COUNT_HINT
source: When and if token cost calculations should be performed
german: Ob und wann Tokenkostenberechnungen durchgeführt werden sollen

# SETTINGS_TOKEN_COUNT_MODEL_CHOICE
source: Model to use for cost estimation:
german: Modell für Kostenabschätzung:

# SETTINGS_TOKEN_COUNT_MODEL_CHOICE_HINT
source: The selection determines what costs per million tokens are considered when using the token cost estimation.
german: Die Auswahl bestimmt, welche Preise pro einer Millionen Tokens für die Kostenabschätzungen herangezogen werden.

# MESSAGE_META_HIDE_META_MESSAGE
source: Hide meta info
german: Meta-Infos verstecken

# MESSAGE_META_SHOW_META_MESSAGE
source: Show meta info
german: Meta-Infos zeigen

# MESSAGE_META_TOGGLE_META_MESSAGE
source: Toggle meta info
german: Meta-Info-Sichtbarkeit umschalten

# MESSAGE_META_TOGGLE_TOKEN_CACLULATIONS
source: Toggle token calculations
german: Kostenabschätzung-Sichtbarkeit umschalten

# META_MESSAGE_TRAINING_COST
source: Training cost
german: Trainingskosten

# META_MESSAGE_INFERENCE_COST
source: Inference cost
german: Inferenzkosten

# META_MESSAGE_BATCH_INFERENCE_COST
source: Batch inference cost
german: Batch-Inferenzkosten

# DISABLED_EXPLANATION_ASSISTANT_CANT_SEND_AUDIO
source: The assistant cannot send audio (in fine-tuning)
german: Der Assistent kann (für fine-tuning) keine Audios senden

# DISABLED_EXPLANATION_ASSISTANT_CANT_SEND_PDF
source: The assistant cannot send PDFs
german: Der Assistent kann keine PDFs senden

source: PDF File
german: PDF-Datei

# MESSAGES_PDF_FILE_MESSAGE_TITLE
source: PDF File Message
german: PDF Datei Nachricht
